config.org
#+TITLE: Doom Emacs Literate Config
#+STARTUP:      overview
#+FILETAGS:     :doom:
#+EXCLUDE_TAGS: SCAFFOLDING ARCHIVE noexport
* Headers :SCAFFOLDING:
#+begin_src emacs-lisp :tangle packages.el
;; -*- no-byte-compile: t; -*-
;;; DOOMDIR/packages.el

;; To install a package with Doom you must declare them here and run 'doom sync'
;; on the command line, then restart Emacs for the changes to take effect -- or
;; use 'M-x doom/reload'.


;; To install SOME-PACKAGE from MELPA, ELPA or emacsmirror:
;(package! some-package)
#+end_src

* Miscellany
** Install prerequisites [2/2]
:PROPERTIES:
:header-args: :noweb yes
:END:
#+name: github_binary_release
#+begin_src sh :exports none
github_binary_release() {
    local func='github_binary_release'
    local repo= asset= prefix= root= binary=
    while [ $# -gt 0 ]
    do
        case $1 in
        --repo)
            # A "<user>/<repo>" string to identify a GitHub repo
            repo=$2 ;;
        --asset)
            # An anchored regular expression used by `jq` for a named tarball
            asset=$2 ;;
        --prefix)
            # Directory to pass to `tar -C`
            prefix=$2 ;;
        --path)
            # Directory path within the tarball to the data root
            # NOTE: This variable cannot be named `path` due to conflict with ZSH
            root=$2 ;;
        --binary)
            # Path relative to the data root to the executable file
            binary=$2 ;;
        esac
        shift; shift
    done
    for arg in "$repo" "$asset" "$prefix" "$root" "$binary"
    do
        [ "X$arg" = X ] && {
            echo >&2 "ERROR: $func: missing argument"
            return 1
        }
    done
    local url=`
        curl -s https://api.github.com/repos/$repo/releases/latest | jq -r \
        '.assets[] | select(.name | test("^'"$asset"'$")) | .browser_download_url'
    `
    [ "X$url" = X ] && {
        echo >&2 "ERROR: $func: could not find URL"
        return 1
    }
    local canonical_path=`readlink -m "$prefix/$root"`
    [ -e "$canonical_path" ] && {
        printf "\
$func: found existing: $canonical_path
$func: (recursively) delete? [y/N]: "
        read delete
        case $delete in
        [yY]*)
            rm -rf "$canonical_path" ;;
        ,*)  echo >&2 "ERROR: $func: refusing to download"
            return 1 ;;
        esac
    }
    mkdir -p "$prefix" "$HOME/.local/bin"
    curl -Lo- "$url" | tar -C "$prefix" -xzf -
    [ -x "$canonical_path/$binary" ] || {
        echo >&2 "ERROR: $func: not an executable file: $canonical_path/$binary"
        return 1
    }
    ln -sf "$canonical_path/$binary" "$HOME/.local/bin"
}
#+end_src

*** DONE macOS
#+begin_src sh :tangle install/macos.sh
#!/bin/sh

# Install Homebrew to install packages
curl -Lo- https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh | bash

# Install NVM to install packages
curl -Lo- https://raw.githubusercontent.com/nvm-sh/nvm/HEAD/install.sh \
    | env PROFILE=/dev/null bash

# Function to install a binary asset from the latest release of a GitHub repo
brew install jq
<<github_binary_release>>
#+end_src

*** DONE Fedora
#+begin_src sh :tangle install/fedora.sh
#!/bin/sh

# Install NVM to install packages
curl -Lo- https://raw.githubusercontent.com/nvm-sh/nvm/HEAD/install.sh \
    | env PROFILE=/dev/null bash

# Install pipx to install packages
sudo dnf -y install pipx

# Function to install a binary asset from the latest release of a GitHub repo
sudo dnf -y install jq
<<github_binary_release>>
#+end_src

* :input
** Headers :SCAFFOLDING:
#+begin_src emacs-lisp :tangle packages.el
;;; :input
#+end_src

** Miscellany [0/0] :ARCHIVE:
#+begin_quote
Miscellaneous configuration without a corresponding module.
#+end_quote

** chinese [0/0] :ARCHIVE:
#+begin_quote
This module adds support for traditional Chinese script by introducing two input
methods: Pinyin and Wubi.
#+end_quote

** japanese [0/0] :ARCHIVE:
#+begin_quote
This module adds support for Japanese script.
#+end_quote

** layout [0/0] :ARCHIVE:
#+begin_quote
This module provides barebones support for using Doom with non-qwerty layouts.
#+end_quote

* :completion
#+begin_quote
Modules that provide new interfaces or frameworks for completion, including code
completion.
#+end_quote

** Headers :SCAFFOLDING:
#+begin_src emacs-lisp :tangle packages.el
;;; :completion
#+end_src

** Miscellany [0/0] :ARCHIVE:
#+begin_quote
Miscellaneous configuration without a corresponding module.
#+end_quote

** company [1/1]
#+begin_quote
This module provides code completion, powered by [[https://github.com/company-mode/company-mode][company-mode]]. It is required
for code completion in many of Doom's :lang modules.
#+end_quote

*** DONE [#B] Never start completion automatically (require =C-SPC=)
#+begin_src emacs-lisp :tangle yes
(setq company-idle-delay nil)
#+end_src

This was born from a desire to prevent autocompletion of ordinary words in Org
buffers, but I decided that I don't really need autocompletion anywhere. The
following are the notes I took when pursuing my original plan:

#+begin_quote
=M-x company-capf= gives ~company-ispell~ as one completion backend in Org
buffers. I guess I'd like to have spelling completion as an option that I could
invoke using =C-SPC= (~+company/complete~), but not something that just pops up
on its own.
#+end_quote

** helm [0/0] :ARCHIVE:
#+begin_quote
This module provides Helm integration for a variety of Emacs commands, as well as
a unified interface for project search and replace, powered by ripgrep.
#+end_quote

** ido [0/0] :ARCHIVE:
** ivy [2/2] :ARCHIVE:
#+begin_quote
This module provides Ivy integration for a variety of Emacs commands, as well as
a unified interface for project search and replace, powered by [[https://github.com/BurntSushi/ripgrep/][ripgrep]].
#+end_quote

*** DONE [#A] Install prerequisites
**** DONE macoS
#+begin_src sh :tangle install/macos.sh
# Install prerequisites for `completion/ivy` module
brew install ripgrep
#+end_src

**** DONE Fedora
#+begin_src sh :tangle install/fedora.sh
# Install prerequisites for `completion/ivy` module
sudo sudo dnf -y install ripgrep
#+end_src

*** DONE [#A] Make it easier to jump to headlines across Org buffers
#+begin_src emacs-lisp :tangle yes
(setq counsel-org-goto-all-outline-path-prefix 'buffer-name)
#+end_src

** vertico [2/2]
#+begin_quote
This module enhances the Emacs search and completion experience, and also
provides a united interface for project search and replace, powered by [[https://github.com/BurntSushi/ripgrep/][ripgrep]].
#+end_quote

*** DONE [#A] Install prerequisites
**** DONE macoS
#+begin_src sh :tangle install/macos.sh
# Install prerequisites for `completion/vertico` module
brew install ripgrep
#+end_src

**** DONE Fedora
#+begin_src sh :tangle install/fedora.sh
# Install prerequisites for `completion/vertico` module
sudo sudo dnf -y install ripgrep
#+end_src

*** DONE [#B] Replace =ivy= with =vertico=
- [X] Enable in =init.el=
- [X] Refactor for =vertico=

* :ui
#+begin_quote
Aesthetic modules that affect the Emacs interface or user experience.
#+end_quote

** Headers :SCAFFOLDING:
#+begin_src emacs-lisp :tangle packages.el
;;; :ui
#+end_src

** Miscellany [6/11]
#+begin_quote
Miscellaneous configuration without a corresponding module.
#+end_quote

*** DONE [#A] Install packages
#+begin_src emacs-lisp :tangle packages.el
(package! col-highlight)
(package! page-break-lines)
(package! imenu-list)

;; More pretty themes by prot
(package! ef-themes)
#+end_src

*** DONE [#B] Dedicate windows
#+begin_src emacs-lisp :tangle yes
(defun my/toggle-window-dedicated ()
  "Control whether or not Emacs is allowed to display another
buffer in current window."
  (interactive)
  (message
   (if (let (window (get-buffer-window (current-buffer)))
         (set-window-dedicated-p window (not (window-dedicated-p window))))
       "%s: Can't touch this!"
     "%s is up for grabs.")
   (current-buffer)))

(define-key! evil-window-map
  ;; replaces `+workspace/close-window-or-workspace'
  "d" #'my/toggle-window-dedicated)
#+end_src

*** DONE [#B] Add key binding for Ilist
#+begin_src emacs-lisp :tangle yes
;; NOTE For whatever reason, I cannot use :defer to lazy-load `imenu-list'
;; without it breaking
(use-package! imenu-list
  :init
  (define-key! doom-leader-open-map "i" #'imenu-list-minor-mode)
  :after imenu)

(after! which-key
  (let ((prefix-re (regexp-opt (list doom-leader-key doom-leader-alt-key))))
    (cl-pushnew `((,(format "\\`%s o i\\'" prefix-re)) nil . "Ilist")
                which-key-replacement-alist)))
#+end_src

*** DONE [#C] Keep icons small by default
#+begin_src emacs-lisp :tangle yes
(setq all-the-icons-scale-factor 1.0)
#+end_src

*** DONE [#C] Don't suggest abbreviations for long command names
#+begin_src emacs-lisp :tangle yes
(setq extended-command-suggest-shorter nil)
#+end_src

*** DONE [#C] Create a function to set frame transparency
https://www.emacswiki.org/emacs/TransparentEmacs
#+begin_src emacs-lisp :tangle yes
(defun my/transparency (value)
  "Sets the transparency of the frame window. 0=transparent/100=opaque"
  (interactive "nTransparency Value 0 - 100 opaque: ")
  (set-frame-parameter (selected-frame) 'alpha value))
#+end_src

*** TODO [#C] Always display Imenu for current buffer in Ilist
If the current buffer does not have Imenu entries, I do not want old ones to
persist in the Ilist, because I find that confusing. Actually, maybe I just want
Ilist to display entries for the list selected buffer (in the current workspace)
that is derived from ~prog-mode~.

In any case, the following does *not* work, because it causes Ilist to update
(and display nothing) when I am just doing stuff in the minibuffer (or within
Ilist itself!), and I'd like to keep it displaying what it had before in those
obvious cases:

#+begin_src emacs-lisp :tangle no
(setq imenu-list-persist-when-imenu-index-unavailable nil)
#+end_src

*** TODO [#C] Keep Ilist the same same size as before when opening and closing it
Could hook into ~imenu-list-quit-window~ and save a variable such as
~my/imenu-list--popup-size~, and then default to that when opening back up.

*** TODO [#C] Disable the cursor in Ilist buffers (like Treemacs)
*** TODO [#C] Remap "<" and ">" to window resize functions in Ilist
Right now, those keys are not being used.

*** TODO [#C] Use a different line truncate character than "$" in Ilist
This is especially annoying when lines get truncated despite the text being
scaled down, because the "$" character is full-sized.

** deft [0/0] :ARCHIVE:
#+begin_quote
[[https://jblevins.org/projects/deft/][Deft]] is a major mode for browsing and filtering notes written in plain text
formats, such as org-mode, markdown, and LaTeX.
#+end_quote

** doom [4/4]
#+begin_quote
This module gives Doom its signature look: powered by the =doom-one= theme
(inspired by Atom's One Dark theme) and =solaire-mode=.
#+end_quote

*** OKAY [#A] Install prerequisites
**** OKAY macOS
#+begin_src sh :tangle install/macos.sh
# Install prerequisites for `ui/doom` module
brew install font-terminus

# TODO: Comic Mono
#+end_src

**** DONE Fedora
#+begin_src sh :tangle install/fedora.sh
# Install prerequisites for `ui/doom` module
sudo dnf -y install terminus-fonts

## Comic Mono
## <https://dtinth.github.io/comic-mono-font>
## <https://docs.fedoraproject.org/en-US/quick-docs/fonts/#unpackaged>
npm install -g comic-mono
mkdir -p "$XDG_DATA_HOME/fonts"
ln -s "`npm root -g`/comic-mono" "$XDG_DATA_HOME/fonts"

## Iosevka Comfy
if [ -e "$XDG_DATA_HOME/fonts/iosevka-comfy/.git" ]
then
    git -C "$XDG_DATA_HOME/fonts/iosevka-comfy" pull
else
    git clone --depth 1 \
        'https://git.sr.ht/~protesilaos/iosevka-comfy' \
        "$XDG_DATA_HOME/fonts/iosevka-comfy"
fi

## Update fonts
fc-cache -v
#+end_src

*** DONE [#A] Never hide the modeline
Without a modeline, the only way to see a clear distinction between the bottom
of a window without a modeline and the top of another window is by using certain
themes in GUI Emacs.

#+begin_src emacs-lisp :tangle yes
;; `always' is just a no-op that returns `t'
(defadvice! my/never-hide-modeline-a (&rest _)
  "Never hide the modeline"
  :around 'hide-mode-line-mode
  #'always)

(after! doom-themes-ext-treemacs
  (defadvice! my/show-treemacs-modeline-a (&rest _)
    "Show the treemacs modeline"
    :around 'doom-themes-hide-modeline
    #'always))

(remove-hook '+popup-buffer-mode-hook #'+popup-set-modeline-on-enable-h)
#+end_src
#+end_src

**** COMMENT Other ways to disable modeline hiding
In the end, I prefer the heavy-handed approach and like to see modelines beneath
all windows. The consistently clear distinction between windows is worth the
exchange of screen real estate.

#+CAPTION: Disable modeline hiding in all popup buffers
#+begin_src emacs-lisp :tangle no
(remove-hook '+popup-buffer-mode-hook #'+popup-set-modeline-on-enable-h)
#+end_src

#+CAPTION: Disable modeline hiding by default in popup buffers
#+begin_src emacs-lisp :tangle no
(plist-put +popup-defaults :modeline t)
#+end_src

#+CAPTION: Disable modeline hiding in specific modes
#+begin_src emacs-lisp :tangle no
;; Not an exhuastive list of hooks
(remove-hook! '(shell-mode-hook
                term-mode-hook
                vterm-mode-hook
                eshell-mode-hook)
              #'hide-mode-line-mode)
#+end_src

