packages.el
;; -*- no-byte-compile: t; -*-
;;; DOOMDIR/packages.el

;; To install a package with Doom you must declare them here and run 'doom sync'
;; on the command line, then restart Emacs for the changes to take effect -- or
;; use 'M-x doom/reload'.


;; To install SOME-PACKAGE from MELPA, ELPA or emacsmirror:
;(package! some-package)

;;; :input

;;; :completion

;;; :ui

(package! col-highlight)
(package! page-break-lines)
(package! imenu-list)

;; More pretty themes by prot
(package! ef-themes)

;;; :editor

;;; :emacs

;;; :term

;;; :checkers

;;; :tools

(when EMACS28+
