config.org
*** TODO Add templates for each file in =eeowaa-project=
*** TODO Add support to =eeowaa-project= for language-specific files
+ =.gitignore= (steal from https://github.com/github/gitignore.git)
+ Packaging (e.g. =package.json=, =Dockerfile=)
+ Execution (e.g. =package.json=, =docker-compose.yml=)
+ =.dir-locals.el= (for =projectile= configuration)
+ =todo.org= (for language-specific boilerplate tasks)

Could add templates under =stow-dotfiles/<lang>/.local/etc/skel/= (this is what
I'm currently doing with Python). I could also create subdirectories under
=skel/= specific to certain project types.

*** TODO Add support to =eeowaa-project= for environment-specific files
+ CI/CD (e.g. steal from https://github.com/Microsoft/azure-pipelines-yaml)
+ PR templates (e.g. =.azuredevops/pull_request_template.md=)

** ansible [1/1]
*** DONE [#A] Install prerequisites
**** DONE macOS
#+begin_src sh :tangle install/macos.sh
# Install prerequisites for `tools/ansible` module
brew install ansible
#+end_src

**** DONE Fedora
#+begin_src sh :tangle install/fedora.sh
# Install prerequisites for `tools/ansible` module
pipx install ansible-core
ansible-galaxy collection install community.general
#+end_src

** debugger [1/3]
Reference: https://docs.doomemacs.org/latest/modules/tools/debugger/

*** OKAY [#A] Install prerequisites
**** OKAY macOS
#+begin_src sh :tangle install/macos.sh
# Install prerequisites for `tools/debugger` module
# https://stackoverflow.com/questions/18423124/please-check-gdb-is-codesigned-see-taskgated8-how-to-get-gdb-installed-w
brew install gdb
#+end_src

**** DONE Fedora
#+begin_src sh :tangle install/fedora.sh
# Install prerequisites for `tools/debugger` module
sudo dnf -y install lldb gdb unzip
nvm install node
#+end_src

*** LOOP [#A] Configure Realgud
See the section for "Realgud" on [[https://docs.doomemacs.org/latest/modules/tools/debugger/][this web page]].

#+begin_src emacs-lisp :tangle no
(after! dap-mode
  (dap-gdb-lldb-setup))
#+end_src

*** TODO [#A] Fix DAP mode error message
I get this error when I visit a file that invokes ~lsp!~:
#+begin_example
(doom-hook-error lsp!
  (error Recursive load
    ~/.config/emacs/.local/straight/build-28.0.50/dap-mode/dap-mode.el
    ~/.config/emacs/.local/straight/build-28.0.50/dap-mode/dap-mode.el
    ~/.config/emacs/.local/straight/build-28.0.50/dap-mode/dap-mode.el
    ~/.config/emacs/.local/straight/build-28.0.50/dap-mode/dap-mode.el
    ~/.config/emacs/.local/straight/build-28.0.50/dap-mode/dap-mode.el
    ~/.config/emacs/.local/straight/build-28.0.50/lsp-mode/lsp-mode.el))
#+end_example

For now, I might just want to unset ~lsp-enable-dap-auto-configure~ and see if
that prevents errors. Worst case, I could disable =debugger=.

*UPDATE*: Unfortunately I was unable to resolve this quickly and opted to
disable =debugger= for the time being (it's not super-important for me right
now, anyway).

** direnv [1/4]
:LOGBOOK:
- Note taken on [2022-08-11 Thu 17:08] \\
  I have re-enabled this module and things seem to be working OK so far. That
  said, I don't have any complicated use cases right now.
:END:
#+begin_quote
This module integrates direnv into Emacs.
#+end_quote

*** DONE [#A] Install prerequisites
**** DONE macOS
#+begin_src sh :tangle install/macos.sh
# Install prerequisites for `tools/direnv` module
brew install direnv
#+end_src

**** DONE Fedora
#+begin_src sh :tangle install/fedora.sh
# Install prerequisites for `tools/direnv` module
sudo dnf -y install direnv
#+end_src

*** TODO [#A] See why =direnv= prevents envvars from propagating between buffers
This is the original reason why I disabled this module.

*UPDATE*: It looks like the =envrc= package is used by the =direnv= module.
According to the =envrc= project's [[https://github.com/purcell/envrc][documentation]]:

#+begin_quote
This library is like the direnv.el package, but sets all environment variables
buffer-locally, while direnv.el changes the global set of environment variables
after each command.
#+end_quote

So environment variables are set buffer-locally. I wonder if I can exclude
certain environment variables (such as AWS credentials) from this rule, or if I
can somehow set them in a global location to get pulled in by all "dir
environments". Maybe there is a rule for that.

For the sake of debugging, you might want to try the following function:

#+begin_src emacs-lisp :tangle yes
(defun my/aws-envvars ()
  "Print the values of AWS environment variables"
  (interactive)
  (dolist (var (seq-filter
                (lambda (s) (string-match "\\`AWS_" s))
                (sort process-environment #'string<)))
    (princ (concat var "\n"))))
#+end_src

*** TODO [#A] Understand how Emacs handles environment variables
+ [ ] Play around with the following Lisp Interaction buffer
  #+begin_src lisp-interaction :tangle no
  ;; Variables
  initial-environment
  process-environment
  exec-path
  doom-env-file

  ;; Function calls
  (getenv "PATH")
  (getenv "PATH" (selected-frame))
  (getenv-internal "PATH")
  (doom/reload-env)
  (doom-load-envvars-file)
  #+end_src
+ [ ] Consult the documentation for all of those variables and functions
+ [ ] See how Doom Emacs uses those functions and variables (=SPC h d e=)
+ [ ] See how =envrc= uses those functions and variables (=C-h C-l envrc RET=)
  - [ ] Retrieve =envrc= source (=M-x package-install RET envrc RET=)

*** TODO [#B] Try =direnv.el= instead of =envrc=
https://github.com/wbolster/emacs-direnv

However, be wary of @purcell's comments on =direnv.el=:
#+begin_quote
+ When switching to a buffer that is not "inside" a project with an =.envrc= file,
  the buffer will see the last project's environment. I would prefer it to see
  the default Emacs environment.

+ When =direnv= fails to execute in the course of switching to a buffer in a new
  project with an =.envrc= file (e.g. because that =.envrc= file is disallowed),
  buffers in the new project will see the environment variables from the
  previous project.

+ Background buffers from a previous project will start seeing the new project's
  environment, so any processes they launch asynchronously after the switch will
  use the wrong environment. (This is probably quite rare in practice.)
#+end_quote

** docker [2/2]
#+begin_quote
This module allows you to manipulate Docker images, containers & more from
Emacs.
#+end_quote

*** DONE [#A] Install prerequisites
**** DONE macOS
#+begin_src sh :tangle install/macos.sh
# Install prerequisites for `tools/docker` module
brew install docker
npm install -g dockerfile-language-server-nodejs
#+end_src

**** DONE Fedora
#+begin_src sh :tangle install/fedora.sh
# Install prerequisites for `tools/docker` module
sudo dnf -y install shadow-utils fuse-overlayfs iptables
sudo systemctl disable --now docker.service docker.socket
dockerd-rootless-setuptool.sh install
curl -fsSL https://get.docker.com/rootless | sh
cat >"$HOME/.profile.d/docker-rootless.sh" <<\EOF
export PATH=$HOME/bin:$PATH
export DOCKER_HOST=unix://$XDG_RUNTIME_DIR/docker.sock
EOF
. "$HOME/.profile.d/docker-rootless.sh"
systemctl --user start docker.service
sudo loginctl enable-linger `whoami`
npm install -g dockerfile-language-server-nodejs
#+end_src

*** DONE [#C] Filename-mode associations
#+begin_src emacs-lisp :tangle yes
(add-to-list 'auto-mode-alist '("/Containerfile\\'" . dockerfile-mode))
#+end_src

** editorconfig [1/1]
#+begin_quote
This module integrates [[https://editorconfig.org/][EditorConfig]] into Emacs, allowing users to dictate code
style on a per-project basis with an =.editorconfig= file ([[https://editorconfig-specification.readthedocs.io/][formal
specification]]).
#+end_quote

*** DONE [#A] Install prerequisites
**** DONE macOS
#+begin_src sh :tangle install/macos.sh
# Install prerequisites for `tools/editorconfig` module
brew install editorconfig
#+end_src

**** DONE Fedora
#+begin_src sh :tangle install/fedora.sh
# Install prerequisites for `tools/editorconfig` module
sudo dnf -y install editorconfig
#+end_src

** ein [3/4]
#+begin_quote
Adds Jupyter notebook integration into emacs.
#+end_quote

*** DONE [#A] Install prerequisites
**** DONE macOS
#+begin_src sh :tangle install/macos.sh
# Install prerequisites for `tools/ein` module
brew install python
pipx install --include-deps jupyter
#+end_src

**** DONE Fedora
#+begin_src sh :tangle install/fedora.sh
# Install prerequisites for `tools/ein` module
sudo dnf -y install python3 pipx
pipx install --include-deps jupyter
#+end_src

*** DONE [#B] Display inline images in output
#+begin_src emacs-lisp :tangle yes
(setq ein:output-area-inlined-images t)
#+end_src

*** DONE [#B] Configure =ob-ein=
#+begin_src emacs-lisp :tangle yes
;; HACK The machinery provided by `ob-ein-languages' and `ob-ein--babelize-lang'
;; is insufficient for bash, so we do it by hand.
(after! ob
  (add-to-list 'org-babel-load-languages '(ein . t))
  (require 'ob-ein)

  ;; Execute in an anonymous local session by default
  (setq ob-ein-default-header-args:ein
        '((:session . "localhost")))

  ;; This does two things:
  ;; 1. Allows the correct kernel to be selected for execution
  ;; 2. Enables bash-specific features in the source buffer
  (when (not (fboundp 'bash-mode))
    (define-derived-mode bash-mode sh-mode "Bash-script"
      "Major mode for editing bash scripts."
      (sh-set-shell "bash" nil nil)))
  (add-to-list 'org-src-lang-modes '("ein-bash" . "bash"))

  ;; Send output from `ein-bash' source blocks back to org buffer
  (let ((alist (assoc-delete-all :results ob-ein-default-header-args:ein)))
    (setq org-babel-default-header-args:ein-bash
          (push '(:results . "output verbatim") alist)))

  ;; Function to execute `ein-bash' source blocks with
  (defun org-babel-execute:ein-bash (body params)
    (require 'ob-shell nil t)
    ;; hack because ob-ein loads independently of ein
    (custom-set-variables '(python-indent-guess-indent-offset-verbose nil))
    (let ((parser 'org-babel-variable-assignments:bash))
      (ob-ein--execute-body
       (if (fboundp parser)
           (org-babel-expand-body:generic
            body params (funcall (symbol-function parser) params))
         body)
       params))))
#+end_src

*** TODO [#C] Exclude result names from =ox-ipynb= output
In the following example, ~a34ef92b-1a76-41b3-a410-79bdac3f55e9~ would appear
after the output block of the resulting IPYNB buffer:

#+begin_src org :eval no
,#+NAME: a34ef92b-1a76-41b3-a410-79bdac3f55e9
,#+begin_src ein-bash
echo "Hi, ${name}!"
,#+end_src

,#+RESULTS: a34ef92b-1a76-41b3-a410-79bdac3f55e9
: Hi, Mom!
#+end_src

A workaround is to simply *not export* the results.

** evay [0/0]
** gist [0/0] :ARCHIVE:
** lookup [1/4]
*** DONE [#A] Install prerequisites
**** DONE macOS
#+begin_src sh :tangle install/macos.sh
# Install prerequisites for `tools/lookup` module
brew install ripgrep sqlite3
#+end_src

**** DONE Fedora
#+begin_src sh :tangle install/fedora.sh
# Install prerequisites for `tools/lookup` module
sudo dnf -y install ripgrep sqlite-3
#+end_src

*** STRT [#A] Automatically install missing docsets
For whatever reason, this is not working (does not get called upon entering a
mode derived from ~prog-mode~, even though ~prog-mode-hook~ does get updated).

#+begin_src emacs-lisp :tangle yes
(when (modulep! :tools lookup +docsets)
  (defun my/ensure-docsets ()
    (dolist (docset dash-docs-docsets)
      (dash-docs-ensure-docset-installed (string-replace " " "_" docset))))
  ;; REVIEW Ensure that `set-docsets!' is only called for modes derived from `prog-mode'
  (add-hook! prog-mode #'my/ensure-docsets))
#+end_src

*** LOOP [#A] Fix the error "Given parent class xref-location is not a class"
Upon [[https://github.com/hlissner/doom-emacs/issues/5658#issuecomment-946207769][Henrick's advice]], I've pinned =xref= to the last known working commit. This
is currently only a problem on Emacs 28.

#+begin_src emacs-lisp :tangle packages.el
(when EMACS28+
  (package! xref :pin "a82f459b37b31546bf274388baf8aca79e9c30d9"))
#+end_src

*** HOLD [#C] Add dictionary and thesaurus backends for =SPC s t/T=
I've done everything that the Doom documentation told me to do, but things
aren't working very well. Just try it out for yourself and see. Might want to
open a PR or two.

** lsp [1/4]
*** COMMENT Documentation
+ [[doom-modules:tools/lsp/README.org][tools/lsp module documentation]]
+ [[doom:.local/straight/repos/lsp-mode/README.md][lsp-mode package README]]
+ [[doom:.local/straight/repos/lsp-mode/docs/page][lsp-mode package documentation]]
  - [[doom:.local/straight/repos/lsp-mode/docs/page/performance.md][performance.md]]
  - [[doom:.local/straight/repos/lsp-mode/docs/page/troubleshooting.md][troubleshooting.md]]

*** DONE [#B] Automatically restart the LSP server when it crashes
#+begin_src emacs-lisp :tangle yes
(after! lsp
  (setq lsp-restart 'auto-restart))
#+end_src

*** TODO [#A] Fix the size of the popup buffer invoked by =M-x lsp=
/Note that ~lsp~ is invoked when you enter a buffer, as well/.

When the frame is too small (e.g. its default size), the first few menu items in
the popup window are cut off, and all you see are options to exclude the file
from the LSP workspace. Unless you know about the other available options, LSP
won't work for you. Unfortunately, resizing the frame does not help.

*** LOOP [#B] Provide better integration with lsp-ui-imenu
+ ~lsp-ui-imenu~ provides a smoother and more aesthetically-pleasing experience
  compared to ~imenu-list~, but there are currently no keybindings to open it.
  - Essentially, I need to map ~lsp-ui-imenu~ to an LSP prefix map
    + =SPC c l T i= would be good for a toggle, but ~lsp-ui-imenu~ by itself
      does not toggle the window.
    + Reference ~imenu-list-minor-mode~ to see how it toggles its window.
+ https://emacs-lsp.github.io/lsp-ui/#lsp-ui-imenu

For now, I am just going to assign ~lsp-ui-imenu~ to Doom's toggle map (having a
hard time figuring out how to assign to the LSP prefix map). It is not really a
toggle (it just refreshes), but it is nice to have a keybinding.

#+begin_src emacs-lisp :tangle yes
(define-key! doom-leader-toggle-map
  "i" #'lsp-ui-imenu)

(after! which-key
  (let ((prefix-re (regexp-opt (list doom-leader-key doom-leader-alt-key))))
    (cl-pushnew `((,(format "\\`%s t i\\'" prefix-re)) nil . "LSP Imenu")
                which-key-replacement-alist)))
#+end_src

*** LOOP [#B] Look into LSP performance improvements
Resources:
+ [[help:lsp-doctor][lsp-doctor]]
+ [[doom:.local/straight/repos/lsp-mode/docs/page/performance.md][performance.md]]

**** LOOP Enable plist-based JSON deserialization
From =performance.md=:

#+begin_quote
1. Configure the following env variable. Make sure that Emacs can see that
   variable (best way to do that is to start Emacs from the shell, not from
   the icon).
   : export LSP_USE_PLISTS=true
2. Delete ~lsp-mode~ related packages.
3. Make sure that ~lsp-use-plists~ is non-nil.
4. Restart Emacs and install again ~lsp-mode~ related packages.
#+end_quote

For whatever reason, after doing all of the above, sometimes hash tables are
expected and I get messages like this:

#+begin_quote
Wrong type argument: hash-table-p
#+end_quote

Until I get things figured out, I am going to continue to use hash tables.

#+begin_src emacs-lisp :tangle no
(setq lsp-use-plists t)
#+end_src

** magit [2/2]
*** STRT [#A] Install prerequisites
**** DONE macOS
#+begin_src sh :tangle install/macos.sh
# Install prerequisites for `tools/magit` module
(cd ~/Documents/src/life/stow-dotfiles && make perl)
brew install perl git-absorb
cpan install App::Git::Autofixup
#+end_src

