config.org
**** DONE [#C] Maintain proper spacing of footnotes
I had to override the ~org-footnote-sort~ function to *not* insert a leading
~\n~ before new footnote definitions.

#+begin_src emacs-lisp :tangle yes
(after! org
  (defun my/org-footnote-sort ()
    "Rearrange footnote definitions in the current buffer.
Sort footnote definitions so they match order of footnote
references.  Also relocate definitions at the end of their
relative section or within a single footnote section, according
to `org-footnote-section'.  Inline definitions are ignored."
    (let ((references (org-footnote--collect-references)))
      (org-preserve-local-variables
       (let ((definitions (org-footnote--collect-definitions 'delete)))
         (org-with-wide-buffer
          (org-footnote--clear-footnote-section)
          ;; Insert footnote definitions at the appropriate location,
          ;; separated by a blank line.  Each definition is inserted
          ;; only once throughout the buffer.
          (let (inserted)
            (dolist (cell references)
              (let ((label (car cell))
                    (nested (not (nth 2 cell)))
                    (inline (nth 3 cell)))
                (unless (or (member label inserted) inline)
                  (push label inserted)
                  (unless (or org-footnote-section nested)
                    ;; If `org-footnote-section' is non-nil, or
                    ;; reference is nested, point is already at the
                    ;; correct position.  Otherwise, move at the
                    ;; appropriate location within the section
                    ;; containing the reference.
                    (goto-char (nth 1 cell))
                    (org-footnote--goto-local-insertion-point))
                  (insert (or (cdr (assoc label definitions))
                              (format "[fn:%s] DEFINITION NOT FOUND." label))
                          "\n"))))
            ;; Insert un-referenced footnote definitions at the end.
            (pcase-dolist (`(,label . ,definition) definitions)
              (unless (member label inserted)
                (insert definition "\n")))))))))
  (advice-add 'org-footnote-sort :override #'my/org-footnote-sort))
#+end_src

**** HOLD [#C] Allow 5 lines of emphasized text
This appears to cause freezes. For now, I'll get by without.

#+begin_src emacs-lisp :tangle no
(after! org
  (setcar (nthcdr 4 org-emphasis-regexp-components) 4))
#+end_src

**** TODO [#C] Ignore surrounding tildes for interactive help functions
Doom's org markup convention is to surround elisp symbols with tildes. However,
this makes it difficult to use commands such as ~counsel-describe-variable~
(=SPC h v=), ~counsel-describe-function~ (=SPC h f=), and ~find-function~
(custom-mapped to =C-h C-f=) for symbols under point.

The current workaround is to select the "object" under point using =v i e= and
then use the corresponding help command. This works well enough, but is an
annoying extra step.

*** Exporting [1/1]
**** DONE [#A] Support exporting to IPython notebooks
#+begin_src emacs-lisp :tangle packages.el
(when (modulep! :lang org +jupyter)
  (package! ox-ipynb
    :recipe (:host github :repo "jkitchin/ox-ipynb")))
#+end_src

Inspiration taken from the =org= module's =config.el=.
#+begin_src emacs-lisp :tangle yes
(use-package! ox-ipynb
  :when (modulep! :lang org +jupyter)
  :after ox
  :config

  ;; Define an `ox-ipynb' export function that excludes results
  (defun my/ox-ipynb-export-to-ipynb-no-results-file
      (&optional async subtreep visible-only body-only info)
    "Export current buffer to a file. Strip results first.
Optional argument ASYNC to asynchronously export.
Optional argument SUBTREEP to export current subtree.
Optional argument VISIBLE-ONLY to only export visible content.
Optional argument BODY-ONLY export only the body.
Optional argument INFO is a plist of options."
    (let ((ox-ipynb-preprocess-hook
           '((lambda ()
               (org-babel-map-src-blocks nil (org-babel-remove-result))))))
      (ox-ipynb-export-to-ipynb-file)))

  ;; Slightly modified from `ob-ipynb' (added dispatch to new export function)
  (org-export-define-derived-backend 'jupyter-notebook 'org
    :menu-entry
    '(?n "Export to jupyter notebook"
         ((?b "to buffer" ox-ipynb-export-to-ipynb-buffer)
          (?n "to notebook" ox-ipynb-export-to-ipynb-file)
          (?N "to nb (no results)" my/ox-ipynb-export-to-ipynb-no-results-file)
          (?o "to notebook and open" ox-ipynb-export-to-ipynb-file-and-open)
          (?p "to participant nb & open" ox-ipynb-export-to-participant-notebook)
          (?r "to nb (no results) and open" ox-ipynb-export-to-ipynb-no-results-file-and-open)
          (?s "to slides and open" ox-ipynb-export-to-ipynb-slides-and-open))))

  ;; Support exporting to bash kernel notebooks
  (let ((kernelspecs (assoc-delete-all 'sh ox-ipynb-kernelspecs))
        (language-infos (assoc-delete-all 'sh ox-ipynb-language-infos)))
    (setq ox-ipynb-kernelspecs
          (push '(sh . (kernelspec . ((display_name . "Bash")
                                      (language . "bash")
                                      (name . "bash")))) kernelspecs)
          ox-ipynb-language-infos
          (push '(sh . (language_info . ((codemirror_mode . "shell")
                                         (file_extension . ".sh")
                                         (mimetype . "text/x-sh")
                                         (name . "bash")
                                         (pygments_lexer . "bash")))) language-infos)))

  ;; Support exporting from `ein-LANG' source blocks
  (when (modulep! :tools ein)
    (dolist (pair '((ipython . "python")
                    (sh . "bash")))
      (let* ((key (car pair))
             (lang (cdr pair))
             (ein-key (intern (concat "ein-" lang)))
             (kernelspec (alist-get key ox-ipynb-kernelspecs))
             (language-info (alist-get key ox-ipynb-language-infos)))
        (pushnew! ox-ipynb-kernelspecs (cons ein-key kernelspec))
        (pushnew! ox-ipynb-language-infos (cons ein-key language-info))))))
#+end_src

*** Publishing [0/0]
*** Working with Source Code [2/3]
**** DONE [#A] Indent source blocks
+ https://emacs.stackexchange.com/a/9483/21977

#+begin_src emacs-lisp :tangle yes
(after! org
  (setq org-src-preserve-indentation nil
        org-edit-src-content-indentation 0))
#+end_src

**** DONE [#B] Show edit buffer in the current window
#+begin_src emacs-lisp :tangle yes
(after! org
  (setq org-src-window-setup 'current-window)
  (setq +popup--display-buffer-alist
        (delq (assoc "^\\*Org Src" +popup--display-buffer-alist)
              +popup--display-buffer-alist))
  (when (bound-and-true-p +popup-mode)
    (setq display-buffer-alist +popup--display-buffer-alist)))
#+end_src

**** LOOP [#B] Make it easy to jump between source and tangled file
Right now, I am only considering tangling to Elisp, since that's what I do most
of the time.

#+begin_src emacs-lisp :tangle yes
(after! projectile
  (pushnew! projectile-other-file-alist
            '("org" "el")
            '("el" "org")))
#+end_src

*** Miscellaneous [0/1]
**** TODO [#C] Use Org speed keys
Just apply your old configuration.

*** Contrib [2/3]
**** DONE [#C] Add ~ditaa~ JAR path
You need ~ditaa~ installed for this to work:
#+begin_src sh :tangle no
brew install ditaa
#+end_src

#+begin_src emacs-lisp :tangle yes
(setq org-ditaa-jar-path
      (cond (IS-MAC
             (file-expand-wildcards "/usr/local/Cellar/ditaa/*/libexec/ditaa-*-standalone.jar"))))
#+end_src

**** TODO [#C] Configure screenshot attachment
By default, =+dragndrop= configures =org-download= to store image links as
attachments rather than hyperlinks. Even after searching on the web, I do not
understand what concrete advantages attachments have over hyperlinks besides
offering more management tools. I would rather be consistent and stick with
hyperlinks for now.

#+begin_src emacs-lisp :tangle yes
(setq org-download-method 'directory
      org-download-image-dir "images")
#+end_src

Note that the following keybindings are very helpful:
+ =SPC m a c= (~org-download-screenshot~) takes a new screenshot and attaches it
+ =SPC m a p= (~org-download-clipboard~) attaches an image from the clipboard

**** DONE [#C] Add ~ditaa~ JAR path
You need ~ditaa~ installed for this to work:
#+begin_src sh :tangle no
brew install ditaa
#+end_src

#+begin_src emacs-lisp :tangle yes
(setq org-ditaa-jar-path
      (cond (IS-MAC
             (file-expand-wildcards "/usr/local/Cellar/ditaa/*/libexec/ditaa-*-standalone.jar"))))
#+end_src

*** Pomodoro [1/3]
**** DONE [#A] Always load =org-pomodoro= :hack:
Would be better to lazy-load this.

#+begin_src emacs-lisp :tangle yes
(require 'org-pomodoro)
#+end_src

**** STRT [#B] Change the chime for =org-pomodoro=
It is obnoxiously loud and shrill. For now, I'm OK with just decreasing the
volume. To do this, the various ~org-pomodoro-*-sound-args~ variables should be
set to whatever command-line options(s) should be passed to
~org-pomodoro-audio-player~ (=/usr/bin/afplay= on macOS).

#+begin_src emacs-lisp :tangle yes
(when (equal org-pomodoro-audio-player "/usr/bin/afplay")
  (let ((args '("-v" "0.125")))
    (setq org-pomodoro-start-sound-args args
          org-pomodoro-finished-sound-args args
          org-pomodoro-overtime-sound-args args
          org-pomodoro-ticking-sound-args args
          org-pomodoro-killed-sound-args args
          org-pomodoro-short-break-sound-args args
          org-pomodoro-long-break-sound-args args)))
#+end_src

**** STRT [#B] Add keybindings for ~org-pomodoro~ and ~org-pomodoro-extend-last-clock~
#+begin_src emacs-lisp :tangle yes
(map! :map org-mode-map
      :localleader
      (:when (modulep! :lang org +pomodoro)
       (:prefix ("c" . "clock")
        "p" #'org-pomodoro
        "P" #'org-pomodoro-extend-last-clock)))
#+end_src

** php [0/0] :ARCHIVE:
#+begin_quote
This module adds support for PHP 5.3+ (including PHP7).
#+end_quote

** plantuml [0/0] :ARCHIVE:
** purescript [0/0] :ARCHIVE:
** python [5/7]
:PROPERTIES:
:CATEGORY: doom/python
:END:
#+begin_quote
Adds Python support to Doom Emacs.
#+end_quote

*** DONE [#A] Install prerequisites
**** OKAY macOS
#+begin_src sh :tangle install/macos.sh
# Install prerequisites for `lang/python` module
brew install python
npm install -g pyright
pipx install pipenv
pipx install pylint
pipx install flake8
pipx install pytest
pipx install nose2
pipx install pyflakes
pipx install isort
pipx install --include-deps jupyter

## Debugging
pip3 install --user debugpy
#+end_src

**** DONE Fedora
#+begin_src sh :tangle install/fedora.sh
# Install prerequisites for `lang/python` module
sudo dnf -y install python3 pipx
npm install -g pyright
pipx install pipenv
pipx install pylint
pipx install flake8
pipx install pytest
pipx install nose2
pipx install pyflakes
pipx install isort
pipx install --include-deps jupyter

## Debugging
pip3 install --user debugpy
#+end_src

*** DONE [#A] Develop and run a simple "Hello World" program :noexport:
More than a simple "Hello World":
+ [[file:~/Documents/src/life/secret-santa/][Secret Santa project]]
+ [[file:~/org/life/notes.org::*Developing with interpreted languages][Notes for developing with interpreted languages]]

*** DONE [#B] Set up fill column for PEP 8 compliance
#+begin_src emacs-lisp :tangle yes
(add-hook! python-mode
  (setq fill-column 79)
  (display-fill-column-indicator-mode))
#+end_src

*** DONE [#C] Filename-mode associations
#+begin_src emacs-lisp :tangle yes
(add-to-list 'auto-mode-alist '("pylint" . conf-mode))
(add-to-list 'auto-mode-alist '("/activate\\'" . shell-script-mode))
#+end_src

*** DONE [#A] Fix quirks with keymaps
#+begin_src emacs-lisp :tangle yes
;; Add "pipenv" label to "e" prefix key
(after! pipenv
  (map! :map python-mode-map
        :localleader
        :prefix ("e" . "pipenv")))
#+end_src

*** STRT [#B] Integrate Pipenv with projectile
For some reason, the =:lang python= module disables ~pipenv-with-projectile~, so
I want to re-enable that here.

_Notes:_
1. ~use-package-hook!~ is needed to reconfigure the ~use-package!~ block in the
   module's original configuration.
2. The ~:pre-init~ section must return ~nil~ in order to override (rather than
   just append to) the original ~:init~ section.
3. How I have Doom Emacs configured, all ~use-package-hook!~ forms *MUST* be
   tangled to =early-init.el=.

#+begin_src emacs-lisp :tangle no
(use-package-hook! pipenv
  :pre-init
  (setq pipenv-with-projectile t)
  nil)
#+end_src

_Verdict_:
+ Unfortunately, the above does not seem to work for whatever reason.
+ Whenever a project is switched, the ~projectile-after-switch-project-hook~
  should run, but it doesn't seem to.
  - This can be seen in the modeline (the virtual environment is still shown in
    workspaces that do not use Pipenv or even Python).
+ Might need to add hooks for ~persp~ mode
  - Doom Emacs does not utilize ~persp-projectile~, so these hooks must be
    manaully set.
+ See the whole discussion here: https://github.com/hlissner/doom-emacs/issues/1666
  - Might want to just use the =:tools direnv= as Henrik suggested

#+begin_src emacs-lisp :tangle no
(defun pipenv-activate-projectile ()
  "Activate integration of Pipenv with Projectile."
  (add-hook
   'projectile-after-switch-project-hook
   (lambda () (funcall pipenv-projectile-after-switch-function))))
#+end_src

*** HOLD [#C] Set up debugging
+ Holding until I complete the following: [[*Fix DAP mode error message][Fix DAP mode error message]]
+ https://docs.doomemacs.org/latest/modules/tools/debugger/

#+begin_src emacs-lisp :tangle yes
(after! dap-mode
  (setq dap-python-debugger 'debugpy))
#+end_src

** qt [0/0] :ARCHIVE:
#+begin_quote
This module provides language functionality for [[https://qt.io][Qt]] specific files.
#+end_quote

** racket [1/1]
#+begin_quote
This module provides integration for [[https://github.com/greghendershott/racket-mode][racket-mode]].
#+end_quote

*** DONE [#A] Install prerequisites
**** OKAY macOS
#+begin_src sh :tangle install/macos.sh
# Install prerequisites for `lang/racket` module
brew install --cask racket
#+end_src

**** DONE Fedora
#+begin_src sh :tangle install/fedora.sh
# Install prerequisites for `lang/racket` module
sudo dnf -y install racket
raco pkg install --auto racket-langserver
#+end_src

** raku [0/0] :ARCHIVE:
#+begin_quote
This module adds a major mode and flycheck for Raku.
#+end_quote

** rest [0/0]
#+begin_quote
This module adds [[https://en.wikipedia.org/wiki/Representational_state_transfer][REST]] support.
#+end_quote

** rst [0/0]
** ruby [0/0] :ARCHIVE:
#+begin_quote
This module add Ruby and optional Ruby on Rails support to Emacs.
#+end_quote

** rust [2/4]
#+begin_quote
This module adds support for the Rust language and integration for its tools,
e.g. ~cargo~.
#+end_quote

*** WAIT [#A] Install prerequisites
**** WAIT macOS
#+begin_src sh :tangle no
# Install prerequisites for `lang/rust` module
#+end_src

