config.org
** zig [0/0] :ARCHIVE:
#+begin_quote
This module adds [[https://ziglang.org/][Zig]] support, with optional (but recommended) LSP support via
[[https://github.com/zigtools/zls][zls]].
#+end_quote

* :email
** Headers :SCAFFOLDING:
#+begin_src emacs-lisp :tangle packages.el
;;; :email
#+end_src

** Miscellany [0/0] :ARCHIVE:
#+begin_quote
Miscellaneous configuration without a corresponding module.
#+end_quote

** mu4e [0/1]
#+begin_quote
This module makes Emacs an email client, using ~mu4e~.
#+end_quote

*** TODO [#B] Set up mu4e with work email
This should probably be done in a separate gitignored file (=custom.el=) for
security's sake.

** notmuch [0/0] :ARCHIVE:
#+begin_quote
This module turns Emacs into an email client using ~notmuch~.
#+end_quote

** wanderlust [0/0] :ARCHIVE:
* :app
#+begin_quote
Application modules are complex and opinionated modules that transform Emacs
toward a specific purpose. They may have additional dependencies and *should be
loaded last*, before =:config= modules.
#+end_quote

** Headers :SCAFFOLDING:
#+begin_src emacs-lisp :tangle packages.el
;;; :app
#+end_src

** Miscellany [2/7]
#+begin_quote
Miscellaneous configuration without a corresponding module.
#+end_quote

*** OKAY [#A] Install prerequisites
**** OKAY macOS
**** DONE Fedora
#+begin_src sh :tangle install/fedora.sh
# Install prerequisites for `app/Miscellany`
sudo dnf -y install w3m
#+end_src

*** DONE [#A] Install packages
#+begin_src emacs-lisp :tangle packages.el
;; Music
(package! counsel-spotify)

;; Weather
(package! noaa)

;; Ebooks
(package! nov)

;; Kubernetes
(package! k8s-mode)   ;; highlighting, snippets, and `k8s-goto-documents'
(package! kubedoc)    ;; `kubedoc' command
(package! kubel)      ;; interaction with pods
(package! kubernetes) ;; interaction with a cluster
(when (modulep! :editor evil +everywhere)
  (package! kubel-evil)
  (package! kubernetes-evil))

;; Browsing
(package! w3m) ;; Better than `eww' IMO
#+end_src

*** STRT [#A] Configure k8s-mode
+ [X] Open k8s manifest files in ~k8s-mode~
  - Configured this with ~:magic~
  - ~:magic~ only works for file-visiting buffers
  - See note in source block for more info
+ [X] Configure documentation lookup
  - Use either ~k8s-goto-documents~ or ~kubedoc~
+ [ ] Fine-tune documentation lookup
  - Attempt to lookup the symbol under point

Reference:
+ ~use-package!~ declarations in emacs/modules/tools/magit/config.el
+ https://blog.chmouel.com/2016/09/07/dealing-with-yaml-in-emacs/

#+begin_src emacs-lisp :tangle yes
;; NOTE k8s manifests do not have to begin with "apiVersion", but I've seen that
;; more often than not. Worst case, if this doesn't end up catching enough, I
;; can write a function that searches for the "^apiVersion:" regexp in a buffer
;; visiting a file whose name matches "\\.yml\\'" or "\\.yaml\\'". I can then
;; replace the "apiVersion:" regex in the :magic form with a call to that function.
(use-package! k8s-mode
  :magic ("apiVersion:" . k8s-mode)
  :config
  (set-lookup-handlers! 'k8s-mode
    :documentation #'kubedoc))

;; REVIEW Is there even a point in having an empty `use-package!' declaration?
(use-package! kubedoc)
#+end_src

*** STRT [#A] Configure kubel
+ [X] Open k8s manifest buffers in ~k8s-mode~
+ [X] Activate =kubel-evil= before =kubel=
+ [ ] Scroll to top of resource buffers after they are populated
  - =kubel= attempts to scroll to the top of the buffers before they are
    populated, I end up needing to scroll to the top myself.
  - Might have to wait for a process to finish
    + ~kubel--describe-resource~
    + ~kubel--exec~
    + ~kubel--sentinel~
    + =SPC h i g m elisp RET g m Sentinels RET=

#+begin_src emacs-lisp :tangle yes
;; REVIEW Compare `kubel' with `kubernetes-el'
;; - kubel is great for working with pods (listing, examining, modifying, logging, and interacting)
;; - kubernetes-el might be closer to Lens in terms of functionality, but I have not tried it yet
(use-package! kubel
  :defer t
  :config
  (defadvice! my/activate-k8s-mode-a (&rest _)
    :after #'kubel-yaml-editing-mode
    (k8s-mode)))

(use-package! kubel-evil
  :after kubel
  :when (modulep! :editor evil +everywhere))
#+end_src

*** STRT [#A] Configure kubernetes
+ [X] Activate =kubernetes-evil= before =kubernetes=
+ [X] Display pods that are done executing
+ [-] Do not automatically refresh
  - [X] https://github.com/kubernetes-el/kubernetes-el/issues/100
  - [-] https://github.com/kubernetes-el/kubernetes-el/issues/286
+ [ ] Use similar keybindings that Doom Emacs does for Magit
+ [ ] Compare =kubernetes= to Lens; missing features:
  - Display resources across all namespaces
  - Display the following types of resources:
    - DaemonSets
    - ...

#+begin_src emacs-lisp :tangle yes
(use-package! kubernetes
  :defer t
  :commands (kubernetes-overview)
  :config
  (setq ;; Disable automatic refresh (call `kubernetes-refresh' manually)
        kubernetes-poll-frequency 3600
        kubernetes-redraw-frequency 3600

        ;; Display pods even if they are done running
        kubernetes-pods-display-completed t))

(use-package! kubernetes-evil
  :after kubernetes-modes
  :when (modulep! :editor evil +everywhere))
#+end_src

*** TODO [#B] Add a project mode for Helm charts
- https://www.reddit.com/r/emacs/comments/my1npn/kuberneteshelm_file_syntax_highlighting_and/
- Reference ~+ansible-yaml-mode~.

Right now, a manual workaround is to run the following commands in sequence
after entering a YAML file that is a Helm chart template:

1. =M-x lsp-disconnect RET= (to remove irrelevant error messages)
2. =M-x k8s-mode RET= (to add minimal font-locking for k8s keywords)
3. =M-x ansible-add-font-lock RET= (to font-lock the templating)

This gives /decent/ font-locking, but is still miles away from an ideal
solution. Alternate font-locking is available via =jinja2-mode=.

#+begin_src emacs-lisp :tangle no
(def-project-mode! my/k8s-helm-yaml-mode
  :modes '(yaml-mode)
  :add-hooks '(k8s-mode ansible) ;; `ansible' gives us good syntax highlighting
  :files "templates/")
#+end_src

*** STRT [#C] Configure w3m
+ [X] Remap =eww= bindings to use =w3m= instead
+ [ ] Redefine some mappings from =evil-collection=
+ [ ] Add mappings for ~w3m-lnum-mode~

#+begin_src emacs-lisp :tangle yes
(setq +lookup-open-url-fn #'w3m-browse-url)
#+end_src

** calendar [0/0] :ARCHIVE:
#+begin_quote
This module adds a calendar view for Emacs, with org and google calendar sync
support.
#+end_quote

** emms [0/0] :ARCHIVE:
#+begin_quote
This module enables Emacs to be used as a music player. It uses [[https://www.musicpd.org/][mpd]] as a backend
server and [[https://musicpd.org/clients/mpc/][mpc]] to update your music database.
#+end_quote

** everywhere [0/1]
#+begin_quote
This module adds system-wide popup Emacs windows for quick edits.
#+end_quote

*** TODO [#A] Install prerequisites
**** WAIT macOS
***** WAIT Create an automator service to run a command
****** DONE Manual instructions
https://support.apple.com/guide/automator/use-a-shell-script-action-in-a-workflow-autbbd4cc11c/mac
#+begin_quote
_Use a shell script action in an Automator workflow on Mac_

You can extend the power of Automator on Mac by using shell commands within a
workflow. For example, you can string several bash shell commands together to
perform complex tasks, and then pass the results to a window.

1. Choose File > New.
2. Select a document type, then click Choose.
3. Type Run Shell Script in the search field, then select Run Shell Script in
   the search results.
4. Drag the Run Shell Script action into your workflow.
5. Click the Shell pop-up menu, then choose the shell environment.
6. Enter your shell commands in the command field.
7. Test your workflow before saving it.
#+end_quote

****** WAIT Use AppleScript to create an Automator Workflow
:LOGBOOK:
- Note taken on [2021-09-28 Tue 11:31] \\
  Waiting for a response on this StackExchange question that I just posted:
  https://apple.stackexchange.com/questions/428066/how-to-create-a-new-automator-workflow-via-applescript
:END:
https://support.apple.com/guide/automator/control-automator-with-scripts-autf238a3e24/2.10/mac/11.0
#+begin_quote
_Control Automator with scripts on Mac_

Automator is a “scriptable” application and can be controlled by AppleScript and
JavaScript for Automation commands. You can execute workflows, create new
workflows, add actions to workflows, get the values that are set within actions,
and much more.

To see Automator commands available to scripts, use Script Editor, included with
macOS.

1. In the Finder, open the Utilities folder in the Applications folder.
2. The Script Editor icon appears in the Utilities folder.
3. Open another Finder window, then open the Applications folder.
4. The Automator icon appears in the Applications folder.
5. Drag the Automator icon onto the Script Editor icon to open the ScriptEditor
   dictionary for Automator.
#+end_quote

Start of my idea for the AppleScript:
#+begin_src applescript :tangle no
on CreateShellScriptAutomatorWorkflow(shell, script, name)
    -- Need to start with Automator closed.
    if running of application "Automator" then
        try
            tell application "Automator" to quit
        on error
            do shell script "killall Automator"
        end try
    end if
    repeat while running of application "Automator" is true
        delay 0.1
    end repeat
    -- Open Automator.
    tell application "Automator"
        activate
        (*
            Now what?
        ,*)
    end tell
end CreateShellScriptAutomatorWorkflow
#+end_src

The following code block should produce the contents of the ~#!/bin/sh~ script:
#+begin_src emacs-lisp :tangle no
(let* ((emacsclient (executable-find "emacsclient"))
       (server-flag (if server-use-tcp "-f" "-s"))
       (server-dir (if server-use-tcp server-auth-dir server-socket-dir))
       (server-file (expand-file-name server-name server-dir)))
  (format "%s %s %s -e '(emacs-everywhere)'" emacsclient server-flag server-file))
#+end_src

***** HOLD Bind the service to a keybinding
****** DONE Manual instructions
https://www.howtogeek.com/286332/how-to-run-any-mac-terminal-command-with-a-keyboard-shortcut/
#+begin_quote
_How to Run Any Mac Terminal Command With a Keyboard Shortcut_
(...)
Save your workflow with a name you’ll recognize, and we’re done with Automator.

Next, head to System Preferences > Keyboard > Shortcuts. In the left panel click
“Services,” and scroll down until you see the service you just created—it should
be under the “General” section.
#+end_quote

****** HOLD Use AppleScript to assign the Workflow to a keybinding
******* DONE Create a script to do this
https://github.com/eeowaa/stow-dotfiles/blob/main/macos/.local/bin/service-shortcut

******* HOLD Call the script
Should eventually tangle to =install/macos.sh= once I have created the Workflow
via AppleScript:

#+begin_src sh :tangle no
service-shortcut 'Emacs everywhere' 4 e # Command+Option+E
#+end_src

**** TODO Fedora
#+begin_src sh :tangle install/fedora.sh
# Install prerequisites for `app/everywhere` module
# XXX This will only work for X sessions (not Wayland)
sudo dnf -y install xclip xdotool xprop xwininfo
#+end_src

***** DONE Get this working on GNOME
When I try this on GNOME, I keep getting messages like this:
: File no longer exists: /tmp/emacs-everywhere-20220715-204508-libreoffice-writer, write buffer to file? (y or n) n

*UPDATE*: It is working for me now on GNOME X11. Maybe it's because I downgraded
to the Emacs 28.1 packaged by Fedora instead of using the COPR repo for Emacs 29
(dev). Still haven't tried with Wayland in a while, though.

***** WAIT Get this working on Wayland
+ Currently a work-in-progress: https://github.com/tecosaur/emacs-everywhere/issues/50
+ I could probably help with this...

***** TODO Automatically map ~doom everywhere~ to a key on GNOME
For now, I just manually mapped it to =Super-D=, but I would like to automate
that. I'm sure it's not too difficult.

** irc [3/5]
#+begin_quote
This module turns Emacs into an IRC client, capable of OS notifications.
#+end_quote

*** DONE [#A] Install prerequisites
**** DONE macOS
#+begin_src sh :tangle install/macos.sh
# Install prerequisites for `app/irc` module
brew install gnutls
#+end_src

**** DONE Fedora
#+begin_src sh :tangle install/fedora.sh
# Install prerequisites for `app/irc` module
sudo dnf -y install gnutls
#+end_src

*** DONE [#A] Configure =circe= for Libera.Chat
This should probably be done in a separate gitignored file (=custom.el=) for
security's sake.

*** DONE [#B] Find some interesting channels
+ Emacs
  - ~#emacs~
  - ~#org-mode~
  - ~#org-roam~
  - ~#systemcrafters~
  - ~#systemcrafters-help~
+ Linux
  - ~#gnu~
  - ~#linux~
  - ~#fedora~
  - ~#systemd~
  - ~#rpm-ecosystem~
+ Programming
  - ~##programming~
  - ~##typescript~
  - ~#python~
  - ~#bash~
  - ~#git~
+ Infrastructure
  - ~##infra-talk~
  - ~##aws~
  - ~#ansible~
  - ~#docker~
  - ~#networking~

*** TODO [#B] Find an easier way to search for channels
This is my current method of searching:

1. Manually enter the following query in a Circe Server buffer:
   : /msg alis LIST *searchterm*

2. Switch over to the newly-created ~alis@irc.libera.chat~ buffer to view
   results. From there, I can enter simple queries like this:
   : LIST *searchterm*

3. Use =SPC , alis RET= to return to that buffer when I want to perform another
   search. Back and forth...

I would much prefer a single =circe= command to do this rather than that whole
song and dance. See also: https://libera.chat/guides/findingchannels

*** TODO [#C] Figure out how to display inline images
** rss [3/5]
#+begin_quote
Read RSS feeds in the comfort of DOOM (Emacs)
#+end_quote

*** DONE [#A] Automatically update feed when opening =elfeed=
#+begin_src emacs-lisp :tangle yes
(after! elfeed
  (add-hook! 'elfeed-search-mode-hook #'elfeed-update))
#+end_src

*** DONE [#B] Allow widening of the description column :hack:
#+begin_src emacs-lisp :tangle yes
(after! elfeed
  ;; Do not truncate RSS entry titles
  (setq elfeed-search-title-max-width 1000)

  ;; Do not truncate RSS entry tags (just need to shift left by 2 characters)
  (defadvice! my/elfeed-format-column-a (str width &optional align)
    "Return STRING truncated or padded to WIDTH - 2 following alignment.
ALIGN should be a keyword :left or :right."
    :override #'elfeed-format-column
    (if (<= width 0)
        ""
      (format (format "%%%s%d.%ds"
                      (if (eq align :left) "-" "")
                      (- width 2)
                      (- width 2))
              str))))
#+end_src

*** DONE [#C] Leave point on the current entry in the ~*elfeed-search*~ buffer
By default, point in ~*elfeed-search*~ is always left on the entry /beneath/ the
currently-displayed entry in ~*elfeed-entry*~, regardless of navigation via
=C-j= or =C-k=. This is only annoying because I would like for the current entry
to be highlighted in ~*elfeed-search~ via =hl-line=.

#+begin_src emacs-lisp :tangle yes
(after! elfeed
  (setq elfeed-search-remain-on-entry t))
#+end_src

*** LOOP [#A] Undo breakage caused by unfortunate pull request
[[https://github.com/hlissner/doom-emacs/pull/5523][This PR]] broke my config. Here is the fix:

#+begin_src emacs-lisp :tangle packages.el
(package! elfeed-goodies :disable t)
#+end_src

If [[https://github.com/hlissner/doom-emacs/pull/5603][this other PR]] gets merged, I may be able to remove this.

