packages.el
(package! counsel-spotify)

;; Weather
(package! noaa)

;; Ebooks
(package! nov)

;; Kubernetes
(package! k8s-mode)   ;; highlighting, snippets, and `k8s-goto-documents'
(package! kubedoc)    ;; `kubedoc' command
(package! kubel)      ;; interaction with pods
(package! kubernetes) ;; interaction with a cluster
(when (modulep! :editor evil +everywhere)
  (package! kubel-evil)
  (package! kubernetes-evil))

;; Browsing
(package! w3m) ;; Better than `eww' IMO

(package! elfeed-goodies :disable t)

;;; :config
